Terraform plan in __terraform__
<details>
  <summary>Plan: 2 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_notifier_oauth2init_function is tainted, so must be replaced
-/+ resource "google_cloudfunctions_function" "gmail_notifier_oauth2init_function" {
      - environment_variables = {} -> null
      ~ https_trigger_url     = "https://europe-west1-lilaobot.cloudfunctions.net/oauth2init" -> (known after apply)
      ~ id                    = "*************************************************************" -> (known after apply)
      - labels                = {} -> null
        name                  = "oauth2init"
      ~ project               = "lilaobot" -> (known after apply)
      ~ region                = "europe-west1" -> (known after apply)
      ~ service_account_email = "lilaobot@appspot.gserviceaccount.com" -> (known after apply)
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#ea1ce19e8ed05dc83617e9dcd59e4e45"
        # (8 unchanged attributes hidden)

      + event_trigger {
          + event_type = (known after apply)
          + resource   = (known after apply)

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.slack_publisher_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "slack_publisher_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/slack-publisher"
        name                  = "slack-publisher"
      ~ source_archive_object = "slack_publisher.zip" -> "slack_publisher.zip#4fbd529289d366c584be6729c6d80e09"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.gmail_notifier_archive_bucket_object must be replaced
-/+ resource "google_storage_bucket_object" "gmail_notifier_archive_bucket_object" {
      ~ content_type   = "application/zip" -> (known after apply)
      ~ crc32c         = "ZYFHJQ==" -> (known after apply)
      ~ detect_md5hash = "Ixfpd2LWkelgDla1gEld2A==" -> "different hash" # forces replacement
      ~ id             = "******************************************************************************" -> (known after apply)
      ~ md5hash        = "Ixfpd2LWkelgDla1gEld2A==" -> (known after apply)
      ~ name           = "gmail_notifier.zip#2317e97762d691e9600e56b580495dd8" -> "gmail_notifier.zip#ea1ce19e8ed05dc83617e9dcd59e4e45" # forces replacement
      ~ output_name    = "gmail_notifier.zip#2317e97762d691e9600e56b580495dd8" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/lilaobot-functions-storage/o/gmail_notifier.zip%232317e97762d691e9600e56b580495dd8" -> (known after apply)
      ~ storage_class  = "STANDARD" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```
</details>

Plan generated in [Create terraform plan #25](https://github.com/Zenika/lilaobot/actions/runs/1093974374)